shelly-tang/YareLampGo_esp32/led_serial.cpp
void renderWink(uint32_t frame) {
  uint32_t pixelColor = color(0, g_brightness, g_brightness);
  if (frame >= 17) {
    drawCombinedPattern(8, pixelColor);
  } else if (frame < 10) {
    drawCombinedPattern(8, pixelColor);
  } else {
    drawCombinedPattern(9, pixelColor);
  }
}

void renderFocused() {
  drawCombinedPattern(g_focusEyesOpen ? 6 : 7, color(0, g_brightness, g_brightness));
}

bool modeIsAnimated(int mode) {
  return (mode >= 1 && mode <= 10) ||
         mode == 20 ||
         mode == 23 ||
         mode == 24 ||
         mode == 27 ||
         mode == 28 ||
         mode == 29 ||
         mode == 31 ||
         mode == 32;
}

bool animationStopsAfterHold(int mode) {
  return mode >= 1 && mode <= 4;
}

bool animationIsComplete(int mode) {
  if (animationStopsAfterHold(mode)) {
    return g_animFrame >= 3;
  }
  if (mode == 32) {
    return g_animFrame >= 17;
  }
  return false;
}

uint32_t frameIntervalMs(int mode) {
  switch (mode) {
    case 1:
    case 2:
    case 3:
    case 4:
      return 200;
    case 5:
    case 6:
    case 7:
    case 8:
      return 50;
    case 9:
      return 20;
    case 10:
      return 50;
    case 20:
      return 150;
    case 23:
      return 200;
    case 24:
      return 200;
    case 27:
      return 80;
    case 28:
      return 1200;
    case 29:
      return 200;
    case 32:
      return 50;
    default:
      return 1000;
  }
}

void renderCurrentLocked() {
  if (!g_outputStarted) {
    g_outputStarted = true;
  }

  g_useEllipseMask = g_mode >= 1 && g_mode <= 10;

  switch (g_mode) {
    case 0:
      clearPixels();
      break;
    case 1:
      renderRingFill(color(g_brightness, 0, 0), g_animFrame);
      break;
    case 2:
      renderRingFill(color(0, g_brightness, 0), g_animFrame);
      break;
    case 3:
      renderRingFill(color(0, 0, g_brightness), g_animFrame);
      break;
    case 4:
      renderRingFill(color(g_brightness, g_brightness, g_brightness), g_animFrame);
      break;
    case 5:
      renderTheater(color(g_brightness, g_brightness, g_brightness), g_animFrame);
      break;
    case 6:
      renderTheater(color(g_brightness, 0, 0), g_animFrame);
      break;
    case 7:
      renderTheater(color(0, g_brightness, 0), g_animFrame);
      break;
    case 8:
      renderTheater(color(0, 0, g_brightness), g_animFrame);
      break;
    case 9:
      renderRainbow(g_animFrame);
      break;
    case 10:
      renderRainbowChase(g_animFrame);
      break;
    case 11:
      drawCombinedPattern(10, color(0, g_brightness, 0));
      break;
    case 12:
      drawCombinedPattern(11, color(0, g_brightness, 0));
      break;
    case 13:
      drawCombinedPattern(12, color(0, g_brightness, 0));
      break;
    case 14:
      drawCombinedPattern(13, color(0, g_brightness, 0));
      break;
    case 15:
      clearPixels();
      drawBitmap8Pair(kCheckPattern, color(0, g_brightness, 0));
      break;
    case 16:
      clearPixels();
      drawBitmap8Pair(kCrossPattern, color(g_brightness, 0, 0));
      break;
    case 17:
      clearPixels();
      drawBitmap8PairWithBottomDots(kExclaimPattern, color(g_brightness, (uint8_t)(g_brightness * 7 / 10), 0));
      break;
    case 18:
      clearPixels();
      drawBitmap8PairWithBottomDots(kQuestionPattern, color(g_brightness, 0, 0));
      break;
    case 19:
      clearPixels();
      drawBitmap8Pair(kStarPattern, color(g_brightness, g_brightness, 0));
      break;
    case 20:
      renderMusic(g_animFrame);
      break;
    case 21:
      drawCombinedPattern(0, color(0, g_brightness, g_brightness));
      break;
    case 22:
      drawCombinedPattern(16, color(0, g_brightness / 3, g_brightness));
      break;
    case 23:
      renderHeart(g_animFrame);
      break;
    case 24:
      renderSurprised(g_animFrame);
      break;
    case 25:
      drawCombinedPattern(3, color(0, g_brightness, g_brightness), color(g_brightness, 0, 0));
      break;
    case 26:
      drawCombinedPattern(1, color(g_brightness, 0, 0));
      break;
    case 27:
      renderThinking(g_animFrame);
      break;
    case 28:
      renderSleep(g_animFrame);
      break;
    case 29:
      renderHelpless(g_animFrame);
      break;
    case 30:
      drawCombinedPattern(2, color(0, g_brightness, g_brightness));
      break;
    case 31:
      renderFocused();
      break;
    case 32:
      renderWink(g_animFrame);
      break;
    case 33:
      drawCombinedPattern(22, color(g_brightness, g_brightness, g_brightness), color(g_brightness, 0, 0));
      break;
    default:
      clearPixels();
      break;
  }

  showPixelsLocked();
}

void resetFocusedAnimationLocked(uint32_t now) {
  g_focusEyesOpen = true;
  g_focusBlinksRemaining = 0;
  g_focusNextTransitionMs = now + 2000 + (esp_random() % 3001);
}

void resetAnimationStateLocked(uint32_t now) {
  g_animFrame = 0;
  // setMode/setBrightness renders frame 0 immediately, so the next step
  // must wait a full frame interval instead of advancing on the next task tick.
  g_lastFrameMs = now;
  g_modeStartedMs = now;
  if (g_mode == 31) {
    resetFocusedAnimationLocked(now);
  }
}

bool updateFocusedAnimationLocked(uint32_t now) {
  if (g_mode != 31 || now < g_focusNextTransitionMs) {
    return false;
  }

  if (g_focusEyesOpen) {
    if (g_focusBlinksRemaining == 0) {
      uint32_t roll = esp_random() % 100;
      if (roll < 70) g_focusBlinksRemaining = 1;
      else if (roll < 95) g_focusBlinksRemaining = 2;
      else g_focusBlinksRemaining = 3;
    }
    g_focusEyesOpen = false;
    g_focusNextTransitionMs = now + 100 + (esp_random() % 81);
  } else {
    g_focusEyesOpen = true;
    if (g_focusBlinksRemaining > 0) {
      --g_focusBlinksRemaining;
    }
    if (g_focusBlinksRemaining > 0) {
      g_focusNextTransitionMs = now + 100 + (esp_random() % 101);
    } else {
      g_focusNextTransitionMs = now + 2000 + (esp_random() % 3001);
    }
  }
  return true;
}

void ledTask(void *) {
  while (true) {
    if (g_ready) {
      uint32_t now = millis();
      if (g_mutex && xSemaphoreTake(g_mutex, pdMS_TO_TICKS(20)) == pdTRUE) {
        bool shouldRender = false;
        if (g_clipActive) {
          uint32_t interval = g_clipFps > 0 ? (1000UL / g_clipFps) : 100;
          if (interval < 16) interval = 16;
          if (g_clipLastFrameMs == 0 || now - g_clipLastFrameMs >= interval) {
            g_clipFrame = (g_clipFrame + 1) % g_clipFrameCount;
            g_clipLastFrameMs = now;
            shouldRender = true;
          }
        } else if (g_mode == 31) {
          shouldRender = updateFocusedAnimationLocked(now);
        } else if (modeIsAnimated(g_mode) && !animationIsComplete(g_mode)) {
          if (g_lastFrameMs == 0 || now - g_lastFrameMs >= frameIntervalMs(g_mode)) {
            g_animFrame++;
            g_lastFrameMs = now;
            shouldRender = true;
          }
        }
        if (shouldRender) {
          if (g_clipActive) {
            renderClipFrameLocked(g_clipFrame);
          } else {
            renderCurrentLocked();
          }
        }
        xSemaphoreGive(g_mutex);
      }
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

bool takeLedLock() {
  return !g_mutex || xSemaphoreTake(g_mutex, pdMS_TO_TICKS(250)) == pdTRUE;
}

